app/controllers/api/v1/auth_controller.rb

SELECT  "venues".* FROM "venues" WHERE "venues"."email" = $1 LIMIT $2  [["email", "steve@email.com"], ["LIMIT", 1]]
---
  def create
    @venue = Venue.find_by(email: venue_auth_params[:email])