app/controllers/api/v1/spotify_users_controller.rb

  def create
    venue = Venue.find_by(slug: spotify_user_params[:venue_slug])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."slug" = $1 LIMIT $2  [["slug", "codered"], ["LIMIT", 1]]