app/controllers/api/v1/venues_controller.rb

  def create
    @venue = Venue.create(venue_params)
---
INSERT INTO "venues" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"