app/controllers/application_controller.rb

  def current_venue
    if decoded_token
      venue_id = decoded_token[0]['venue_id']
      @venue = Venue.find(venue_id)
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]