app/models/spotify_api.rb

INSERT INTO "spotify_users" ("spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["spotify_id", "sfarv"], ["created_at", "2018-11-03 22:30:39.953843"], ["updated_at", "2018-11-03 22:30:39.953843"]]
SELECT  "spotify_users".* FROM "spotify_users" WHERE "spotify_users"."spotify_id" = $1 LIMIT $2  [["spotify_id", "sfarv"], ["LIMIT", 1]]
UPDATE "spotify_users" SET "display_name" = $1, "email" = $2, "has_paid_spotify" = $3, "birthday" = $4, "country" = $5, "followers" = $6, "updated_at" = $7 WHERE "spotify_users"."id" = $8
INSERT INTO "venue_spotify_users" ("venue_id", "spotify_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["venue_id", 1], ["spotify_user_id", 1], ["created_at", "2018-11-03 23:27:26.835026"], ["updated_at", "2018-11-03 23:27:26.835026"]]
---
  def self.get_user_info(access_token, venue)
    url = 'https://api.spotify.com/v1/me'

    api_data = RestClient.get(url, headers={'Authorization': 'Bearer ' + access_token})
    parsed_data = JSON.parse(api_data)

    user = SpotifyUser.find_or_create_by(spotify_id: parsed_data["id"])

    user["spotify_id"] = parsed_data["id"]
    user["country"] = parsed_data["country"]
    user["email"] = parsed_data["email"]
    user["followers"] = parsed_data["followers"]["total"]
    user["display_name"] = parsed_data["display_name"]
    user["has_paid_spotify"] = parsed_data["product"] == "premium"
    user["birthday"] = parsed_data["birthdate"]

    user.save

    VenueSpotifyUser.find_or_create_by(
      venue: venue,
      spotify_user: user
    )

INSERT INTO "artists" ("spotify_id") VALUES ($1) RETURNING "id"  [["spotify_id", "79bxUQsBIXO8nVLB9fYKf7"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."spotify_id" = $1 LIMIT $2  [["spotify_id", "5DfFzOY7Ql0v8e3U6C4lDk"], ["LIMIT", 1]]
INSERT INTO "spotify_user_artists" ("spotify_user_id", "artist_id", "rank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["spotify_user_id", 1], ["artist_id", 1], ["rank", 1], ["created_at", "2018-11-03 23:33:51.624742"], ["updated_at", "2018-11-03 23:33:51.624742"]]
---
  def self.parse_one_artist(artist_object, index, user)
    artist = Artist.find_or_create_by(spotify_id: artist_object["id"])

    SpotifyUserArtist.create({
      spotify_user: user,
      artist: artist,
      rank: index
    })