app/models/venue.rb

  def most_popular_artists(is_weighted)

    users = VenueSpotifyUser.all.select{|venue_spotify_user| venue_spotify_user.venue == self}

    venue_artists_hash = {}

    users.each do |user|
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "venue_spotify_users".* FROM "venue_spotify_users"

  def most_popular_genres(is_weighted)
    artists = most_popular_artists(is_weighted)

    venue_genres_hash = {}

    artists.each do |artist_name, score|
      artist = Artist.find_by(name: artist_name)

      artist.genres.each do |genre|
---
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 LIMIT $2  [["name", "Coro De La Abadía Benedictina De Santo Domingo De Silos"], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "artist_genres" ON "genres"."id" = "artist_genres"."genre_id" WHERE "artist_genres"."artist_id" = $1  [["artist_id", 4]]