app/models/venue_spotify_user.rb

  def get_top_artists
    SpotifyUserArtist.all.select do |spotify_user_artist|
---
SELECT "spotify_user_artists".* FROM "spotify_user_artists"